examples/flows/compiled/while_mutations_in_loop/flow.dot
digraph "while_mutations_in_loop" {
    rankdir=TB;
    node [shape=box, style=filled, fontname="Helvetica"];

    end_while_mutations_in_loop_flow [label="end_while_mutations_in_loop_flow", fillcolor=palegreen];
    handler_finalize [label="handler_finalize", fillcolor=lightblue];
    handler_init [label="handler_init", fillcolor=lightblue];
    handler_process [label="handler_process", fillcolor=lightblue];
    router_while_mutations_in_loop_flow_line_13_seq_4 [label="router_while_mutations_in_loop_flow_line_13_seq_4", fillcolor=wheat];
    router_while_mutations_in_loop_flow_line_15_while_1 [label="router_while_mutations_in_loop_flow_line_15_while_1", fillcolor=wheat];
    router_while_mutations_in_loop_flow_line_16_seq_3 [label="router_while_mutations_in_loop_flow_line_16_seq_3", fillcolor=wheat];
    router_while_mutations_in_loop_flow_line_20_seq_2 [label="router_while_mutations_in_loop_flow_line_20_seq_2", fillcolor=wheat];
    start_while_mutations_in_loop_flow [label="start_while_mutations_in_loop_flow", fillcolor=palegreen];

    start_while_mutations_in_loop_flow -> handler_init;
    handler_init -> router_while_mutations_in_loop_flow_line_13_seq_4;
    router_while_mutations_in_loop_flow_line_16_seq_3 -> handler_process;
    handler_process -> router_while_mutations_in_loop_flow_line_20_seq_2;
    router_while_mutations_in_loop_flow_line_15_while_1 -> router_while_mutations_in_loop_flow_line_16_seq_3 [label="p['i'] < p['max_iterations']"];
    router_while_mutations_in_loop_flow_line_15_while_1 -> handler_finalize [label="not (p['i'] < p['max_iterations'])"];
    router_while_mutations_in_loop_flow_line_13_seq_4 -> router_while_mutations_in_loop_flow_line_15_while_1;
    router_while_mutations_in_loop_flow_line_20_seq_2 -> router_while_mutations_in_loop_flow_line_15_while_1;
    handler_finalize -> end_while_mutations_in_loop_flow;
}
